In [21]:
import pandas as pd

#### Load Data

In [10]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: str = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.
    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

In [53]:
df=pd.read_csv('car_financing.csv')

In [24]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [25]:
df.tail()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.029,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.029,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.029,VW Golf R

#### Data Types

In [27]:
df.dtypes

Month                 int64
Starting Balance    float64
Repayment           float64
Interest Paid       float64
Principal Paid      float64
New Balance         float64
term                  int64
interest_rate       float64
car_type             object
dtype: object

In [29]:
df.shape #Rows x Columns

(408, 9)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408 entries, 0 to 407
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             408 non-null    int64
 1   Starting Balance  408 non-null    float64
 2   Repayment         408 non-null    float64
 3   Interest Paid     407 non-null    float64
 4   Principal Paid    408 non-null    float64
 5   New Balance       408 non-null    float64
 6   term              408 non-null    int64
 7   interest_rate     408 non-null    float64
 8   car_type          408 non-null    object
dtypes: float64(6), int64(2), object(1)
memory usage: 28.8+ KB

#### Slicing

In [32]:
df[['car_type']].head()

        car_type
0  Toyota Sienna
1  Toyota Sienna
2  Toyota Sienna
3  Toyota Sienna
4  Toyota Sienna

In [33]:
df[['car_type','Interest Paid']].head()

        car_type  Interest Paid
0  Toyota Sienna         202.93
1  Toyota Sienna         200.10
2  Toyota Sienna         197.25
3  Toyota Sienna         194.38
4  Toyota Sienna         191.50

In [34]:
df['car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

#### Selecting Series

In [37]:
df['car_type'][0:10]

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
5    Toyota Sienna
6    Toyota Sienna
7    Toyota Sienna
8    Toyota Sienna
9    Toyota Sienna
Name: car_type, dtype: object

In [38]:
df.car_type.head() #This wont work with column names having Space or column name is same as pandas methods

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

In [39]:
df.car_type.count()

408

In [40]:
df.car_type.value_counts()

VW Golf R         144
Toyota Sienna     120
Toyota Carolla    111
Toyota Corolla     33
Name: car_type, dtype: int64

In [54]:
filter=df['car_type']=='Toyota Sienna'

In [55]:
df=df[filter]

In [46]:
df.car_type.value_counts()

Toyota Sienna    120
Name: car_type, dtype: int64

In [48]:
df.interest_rate.value_counts()

0.0702    60
0.0359    60
Name: interest_rate, dtype: int64

In [61]:
filter_intrate=df['interest_rate']==0.0359

In [57]:
df=df.loc[filtet_intrate,:]

In [58]:
df.interest_rate.value_counts(dropna=False)

0.0359    60
Name: interest_rate, dtype: int64

In [62]:
df=df.loc[filter&filter_intrate,:]

####  Renaming Columns

In [65]:
###Dictionary method

In [66]:
df.columns

Index(['Month', 'Starting Balance', 'Repayment', 'Interest Paid',
       'Principal Paid', 'New Balance', 'term', 'interest_rate', 'car_type'],
      dtype='object')

In [67]:
df=df.rename(columns={'Starting Balance':'Starting_Balance',
                     'Interest Paid':'Interest_Paid',
                     'Principal Paid':'Principal_Paid',
                     'New Balance':'New_Balance'})

In [70]:
###List Method, But Error Prone

In [69]:
df.columns=['Month', 'Starting_Balance', 'Repayment', 'Interest_Paid',
       'Principal_Paid', 'New_Balance', 'term', 'interest_rate', 'car_type']

#### Dropping Columns

In [71]:
df=df.drop(columns=['term']) #dropping multiple Columns

In [72]:
del df['Repayment'] #dropping single columns

In [73]:
df.head()

,Month,Starting_Balance,Interest_Paid,Principal_Paid,New_Balance,interest_rate,car_type
60,1,34689.96,103.78,528.69,34161.27,0.0359,Toyota Sienna
61,2,34161.27,102.19,530.28,33630.99,0.0359,Toyota Sienna
62,3,33630.99,100.61,531.86,33099.13,0.0359,Toyota Sienna
63,4,33099.13,99.02,533.45,32565.68,0.0359,Toyota Sienna
64,5,32565.68,97.42,535.05,32030.63,0.0359,Toyota Sienna

In [74]:
df['Interest_Paid'].sum()

3166.89

In [75]:
df.sum() #Excludes NaN/Null by default

Month                                                            1830
Starting_Balance                                           1.0891e+06
Interest_Paid                                                 3166.89
Principal_Paid                                                34690.3
New_Balance                                               1.05441e+06
interest_rate                                                   2.154
car_type            Toyota SiennaToyota SiennaToyota SiennaToyota ...
dtype: object

#### Missing Data

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60 entries, 60 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             60 non-null     int64
 1   Starting_Balance  60 non-null     float64
 2   Interest_Paid     59 non-null     float64
 3   Principal_Paid    60 non-null     float64
 4   New_Balance       60 non-null     float64
 5   interest_rate     60 non-null     float64
 6   car_type          60 non-null     object
dtypes: float64(5), int64(1), object(1)
memory usage: 3.8+ KB

In [77]:
df['Interest_Paid'].isna()

60     False
61     False
62     False
63     False
64     False
65     False
66     False
67     False
68      True
69     False
70     False
71     False
72     False
73     False
74     False
75     False
76     False
77     False
78     False
79     False
80     False
81     False
82     False
83     False
84     False
85     False
86     False
87     False
88     False
89     False
90     False
91     False
92     False
93     False
94     False
95     False
96     False
97     False
98     False
99     False
100    False
101    False
102    False
103    False
104    False
105    False
106    False
107    False
108    False
109    False
110    False
111    False
112    False
113    False
114    False
115    False
116    False
117    False
118    False
119    False
Name: Interest_Paid, dtype: bool

In [78]:
df['Interest_Paid'].isna().sum()

1

In [79]:
miss=df['Interest_Paid'].isna()

In [80]:
df[miss]

,Month,Starting_Balance,Interest_Paid,Principal_Paid,New_Balance,interest_rate,car_type
68,9,30415.85,NaN,541.48,29874.37,0.0359,Toyota Sienna

In [82]:
True+False+False

1

#### Filling Missing Values

In [ ]:
#Remove missing Value

In [88]:
df

,Month,Starting_Balance,Interest_Paid,Principal_Paid,New_Balance,interest_rate,car_type
60,1,34689.96,103.78,528.69,34161.27,0.0359,Toyota Sienna
61,2,34161.27,102.19,530.28,33630.99,0.0359,Toyota Sienna
62,3,33630.99,100.61,531.86,33099.13,0.0359,Toyota Sienna
63,4,33099.13,99.02,533.45,32565.68,0.0359,Toyota Sienna
64,5,32565.68,97.42,535.05,32030.63,0.0359,Toyota Sienna
65,6,32030.63,95.82,536.65,31493.98,0.0359,Toyota Sienna
66,7,31493.98,94.21,538.26,30955.72,0.0359,Toyota Sienna
67,8,30955.72,92.60,539.87,30415.85,0.0359,Toyota Sienna
68,9,30415.85,NaN,541.48,29874.37,0.0359,Toyota Sienna
69,10,29874.37,89.37,543.10,29331.27,0.0359,Toyota Sienna
70,11,29331.27,87.74,544.73,28786.54,0.0359,Toyota Sienna
71,12,28786.54,86.11,546.36,28240.18,0.0359,Toyota Sienna
72,13,28240.18,84.48,547.99,27692.19,0.0359,Toyota Sienna
73,14,27692.19,82.84,549.63,27142.56,0.0359,Toyota Sienna
74,15,27142.56,81.20,551.27,26591.29,0.0359,Toyota Sienna
75,16,26591.29,79.55,552.92,26038.37,0.0359,Toyota Sienna
76,17,26038.37,77.89,554.58,25483.79,0.0359,Toyota Sienna
77,18,25483.79,76.23,556.24,24927.55,0.0359,Toyota Sienna
78,19,24927.55,74.57,557.90,24369.65,0.0359,Toyota Sienna
79,20,24369.65,72.90,559.57,23810.08,0.0359,Toyota Sienna
80,21,23810.08,71.23,561.24,23248.84,0.0359,Toyota Sienna
81,22,23248.84,69.55,562.92,22685.92,0.0359,Toyota Sienna
82,23,22685.92,67.86,564.61,22121.31,0.0359,Toyota Sienna
83,24,22121.31,66.17,566.30,21555.01,0.0359,Toyota Sienna
84,25,21555.01,64.48,567.99,20987.02,0.0359,Toyota Sienna
85,26,20987.02,62.78,569.69,20417.33,0.0359,Toyota Sienna
86,27,20417.33,61.08,571.39,19845.94,0.0359,Toyota Sienna
87,28,19845.94,59.37,573.10,19272.84,0.0359,Toyota Sienna
88,29,19272.84,57.65,574.82,18698.02,0.0359,Toyota Sienna
89,30,18698.02,55.93,576.54,18121.48,0.0359,Toyota Sienna
90,31,18121.48,54.21,578.26,17543.22,0.0359,Toyota Sienna
91,32,17543.22,52.48,579.99,16963.23,0.0359,Toyota Sienna
92,33,16963.23,50.74,581.73,16381.50,0.0359,Toyota Sienna
93,34,16381.50,49.00,583.47,15798.03,0.0359,Toyota Sienna
94,35,15798.03,47.26,585.21,15212.82,0.0359,Toyota Sienna
95,36,15212.82,45.51,586.96,14625.86,0.0359,Toyota Sienna
96,37,14625.86,43.75,588.72,14037.14,0.0359,Toyota Sienna
97,38,14037.14,41.99,590.48,13446.66,0.0359,Toyota Sienna
98,39,13446.66,40.22,592.25,12854.41,0.0359,Toyota Sienna
99,40,12854.41,38.45,594.02,12260.39,0.0359,Toyota Sienna
100,41,12260.39,36.67,595.80,11664.59,0.0359,Toyota Sienna
101,42,11664.59,34.89,597.58,11067.01,0.0359,Toyota Sienna
102,43,11067.01,33.10,599.37,10467.64,0.0359,Toyota Sienna
103,44,10467.64,31.31,601.16,9866.48,0.0359,Toyota Sienna
104,45,9866.48,29.51,602.96,9263.52,0.0359,Toyota Sienna
105,46,9263.52,27.71,604.76,8658.76,0.0359,Toyota Sienna
106,47,8658.76,25.90,606.57,8052.19,0.0359,Toyota Sienna
107,48,8052.19,24.08,608.39,7443.80,0.0359,Toyota Sienna
108,49,7443.80,22.26,610.21,6833.59,0.0359,Toyota Sienna
109,50,6833.59,20.44,612.03,6221.56,0.0359,Toyota Sienna
110,51,6221.56,18.61,613.86,5607.70,0.0359,Toyota Sienna
111,52,5607.70,16.77,615.70,4992.00,0.0359,Toyota Sienna
112,53,4992.00,14.93,617.54,4374.46,0.0359,Toyota Sienna
113,54,4374.46,13.08,619.39,3755.07,0.0359,Toyota Sienna
114,55,3755.07,11.23,621.24,3133.83,0.0359,Toyota Sienna
115,56,3133.83,9.37,623.10,2510.73,0.0359,Toyota Sienna
116,57,2510.73,7.51,624.96,1885.77,0.0359,Toyota Sienna
117,58,1885.77,5.64,626.83,1258.94,0.0359,Toyota Sienna
118,59,1258.94,3.76,628.71,630.23,0.0359,Toyota Sienna
119,60,630.23,1.88,630.59,-0.36,0.0359,Toyota Sienna

In [101]:
df['Interest_Paid'].fillna(0).head(10) #Replace with zero

60    103.78
61    102.19
62    100.61
63     99.02
64     97.42
65     95.82
66     94.21
67     92.60
68      0.00
69     89.37
Name: Interest_Paid, dtype: float64

In [102]:
df['Interest_Paid'].fillna(method='ffill').head(10) #forwardfill

60    103.78
61    102.19
62    100.61
63     99.02
64     97.42
65     95.82
66     94.21
67     92.60
68     92.60
69     89.37
Name: Interest_Paid, dtype: float64

In [103]:
df['Interest_Paid'].fillna(method='bfill').head(10) #backfill

60    103.78
61    102.19
62    100.61
63     99.02
64     97.42
65     95.82
66     94.21
67     92.60
68     89.37
69     89.37
Name: Interest_Paid, dtype: float64

In [ ]:
### Linear Interpolation

In [105]:
df['Interest_Paid'].interpolate(method='linear').head(10) #Linear Interpolate

60    103.780
61    102.190
62    100.610
63     99.020
64     97.420
65     95.820
66     94.210
67     92.600
68     90.985
69     89.370
Name: Interest_Paid, dtype: float64

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60 entries, 60 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             60 non-null     int64
 1   Starting_Balance  60 non-null     float64
 2   Interest_Paid     59 non-null     float64
 3   Principal_Paid    60 non-null     float64
 4   New_Balance       60 non-null     float64
 5   interest_rate     60 non-null     float64
 6   car_type          60 non-null     object
dtypes: float64(5), int64(1), object(1)
memory usage: 3.8+ KB

In [108]:
df.loc[miss,'Interest_Paid']=90.985

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60 entries, 60 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             60 non-null     int64
 1   Starting_Balance  60 non-null     float64
 2   Interest_Paid     60 non-null     float64
 3   Principal_Paid    60 non-null     float64
 4   New_Balance       60 non-null     float64
 5   interest_rate     60 non-null     float64
 6   car_type          60 non-null     object
dtypes: float64(5), int64(1), object(1)
memory usage: 3.8+ KB

In [ ]:
###Can be None or NaN
### isna or isnull

In [7]:
df['Interest Paid'].isna().sum()

0

In [111]:
#Numpy Arrays

In [113]:
df.to_numpy()

array([[1, 34689.96, 103.78, 528.69, 34161.27, 0.0359, 'Toyota Sienna'],
       [2, 34161.27, 102.19, 530.28, 33630.99, 0.0359, 'Toyota Sienna'],
       [3, 33630.99, 100.61, 531.86, 33099.13, 0.0359, 'Toyota Sienna'],
       [4, 33099.13, 99.02, 533.45, 32565.68, 0.0359, 'Toyota Sienna'],
       [5, 32565.68, 97.42, 535.05, 32030.63, 0.0359, 'Toyota Sienna'],
       [6, 32030.63, 95.82, 536.65, 31493.98, 0.0359, 'Toyota Sienna'],
       [7, 31493.98, 94.21, 538.26, 30955.72, 0.0359, 'Toyota Sienna'],
       [8, 30955.72, 92.6, 539.87, 30415.85, 0.0359, 'Toyota Sienna'],
       [9, 30415.85, 90.985, 541.48, 29874.37, 0.0359, 'Toyota Sienna'],
       [10, 29874.37, 89.37, 543.1, 29331.27, 0.0359, 'Toyota Sienna'],
       [11, 29331.27, 87.74, 544.73, 28786.54, 0.0359, 'Toyota Sienna'],
       [12, 28786.54, 86.11, 546.36, 28240.18, 0.0359, 'Toyota Sienna'],
       [13, 28240.18, 84.48, 547.99, 27692.19, 0.0359, 'Toyota Sienna'],
       [14, 27692.19, 82.84, 549.63, 27142.56, 0.0359, 'Toyota Sienna'],
       [15, 27142.56, 81.2, 551.27, 26591.29, 0.0359, 'Toyota Sienna'],
       [16, 26591.29, 79.55, 552.92, 26038.37, 0.0359, 'Toyota Sienna'],
       [17, 26038.37, 77.89, 554.58, 25483.79, 0.0359, 'Toyota Sienna'],
       [18, 25483.79, 76.23, 556.24, 24927.55, 0.0359, 'Toyota Sienna'],
       [19, 24927.55, 74.57, 557.9, 24369.65, 0.0359, 'Toyota Sienna'],
       [20, 24369.65, 72.9, 559.57, 23810.08, 0.0359, 'Toyota Sienna'],
       [21, 23810.08, 71.23, 561.24, 23248.84, 0.0359, 'Toyota Sienna'],
       [22, 23248.84, 69.55, 562.92, 22685.92, 0.0359, 'Toyota Sienna'],
       [23, 22685.92, 67.86, 564.61, 22121.31, 0.0359, 'Toyota Sienna'],
       [24, 22121.31, 66.17, 566.3, 21555.01, 0.0359, 'Toyota Sienna'],
       [25, 21555.01, 64.48, 567.99, 20987.02, 0.0359, 'Toyota Sienna'],
       [26, 20987.02, 62.78, 569.69, 20417.33, 0.0359, 'Toyota Sienna'],
       [27, 20417.33, 61.08, 571.39, 19845.94, 0.0359, 'Toyota Sienna'],
       [28, 19845.94, 59.37, 573.1, 19272.84, 0.0359, 'Toyota Sienna'],
       [29, 19272.84, 57.65, 574.82, 18698.02, 0.0359, 'Toyota Sienna'],
       [30, 18698.02, 55.93, 576.54, 18121.48, 0.0359, 'Toyota Sienna'],
       [31, 18121.48, 54.21, 578.26, 17543.22, 0.0359, 'Toyota Sienna'],
       [32, 17543.22, 52.48, 579.99, 16963.23, 0.0359, 'Toyota Sienna'],
       [33, 16963.23, 50.74, 581.73, 16381.5, 0.0359, 'Toyota Sienna'],
       [34, 16381.5, 49.0, 583.47, 15798.03, 0.0359, 'Toyota Sienna'],
       [35, 15798.03, 47.26, 585.21, 15212.82, 0.0359, 'Toyota Sienna'],
       [36, 15212.82, 45.51, 586.96, 14625.86, 0.0359, 'Toyota Sienna'],
       [37, 14625.86, 43.75, 588.72, 14037.14, 0.0359, 'Toyota Sienna'],
       [38, 14037.14, 41.99, 590.48, 13446.66, 0.0359, 'Toyota Sienna'],
       [39, 13446.66, 40.22, 592.25, 12854.41, 0.0359, 'Toyota Sienna'],
       [40, 12854.41, 38.45, 594.02, 12260.39, 0.0359, 'Toyota Sienna'],
       [41, 12260.39, 36.67, 595.8, 11664.59, 0.0359, 'Toyota Sienna'],
       [42, 11664.59, 34.89, 597.58, 11067.01, 0.0359, 'Toyota Sienna'],
       [43, 11067.01, 33.1, 599.37, 10467.64, 0.0359, 'Toyota Sienna'],
       [44, 10467.64, 31.31, 601.16, 9866.48, 0.0359, 'Toyota Sienna'],
       [45, 9866.48, 29.51, 602.96, 9263.52, 0.0359, 'Toyota Sienna'],
       [46, 9263.52, 27.71, 604.76, 8658.76, 0.0359, 'Toyota Sienna'],
       [47, 8658.76, 25.9, 606.57, 8052.19, 0.0359, 'Toyota Sienna'],
       [48, 8052.19, 24.08, 608.39, 7443.8, 0.0359, 'Toyota Sienna'],
       [49, 7443.8, 22.26, 610.21, 6833.59, 0.0359, 'Toyota Sienna'],
       [50, 6833.59, 20.44, 612.03, 6221.56, 0.0359, 'Toyota Sienna'],
       [51, 6221.56, 18.61, 613.86, 5607.7, 0.0359, 'Toyota Sienna'],
       [52, 5607.7, 16.77, 615.7, 4992.0, 0.0359, 'Toyota Sienna'],
       [53, 4992.0, 14.93, 617.54, 4374.46, 0.0359, 'Toyota Sienna'],
       [54, 4374.46, 13.08, 619.39, 3755.07, 0.0359, 'Toyota Sienna'],
       [55, 3755.07, 11.23, 621.24, 3133.83, 0.0359, 'Toyota Sienna'],
       [56, 3133.83, 9.37, 623.1, 2510.73, 0.0359, 'Toyota Sienna'],
       [57, 2510.73, 7.51, 624.96, 1885.77, 0.0359, 'Toyota Sienna'],
       [58, 1885.77, 5.64, 626.83, 1258.94, 0.0359, 'Toyota Sienna'],
       [59, 1258.94, 3.76, 628.71, 630.23, 0.0359, 'Toyota Sienna'],
       [60, 630.23, 1.88, 630.59, -0.36, 0.0359, 'Toyota Sienna']],
      dtype=object)

In [114]:
df.values

array([[1, 34689.96, 103.78, 528.69, 34161.27, 0.0359, 'Toyota Sienna'],
       [2, 34161.27, 102.19, 530.28, 33630.99, 0.0359, 'Toyota Sienna'],
       [3, 33630.99, 100.61, 531.86, 33099.13, 0.0359, 'Toyota Sienna'],
       [4, 33099.13, 99.02, 533.45, 32565.68, 0.0359, 'Toyota Sienna'],
       [5, 32565.68, 97.42, 535.05, 32030.63, 0.0359, 'Toyota Sienna'],
       [6, 32030.63, 95.82, 536.65, 31493.98, 0.0359, 'Toyota Sienna'],
       [7, 31493.98, 94.21, 538.26, 30955.72, 0.0359, 'Toyota Sienna'],
       [8, 30955.72, 92.6, 539.87, 30415.85, 0.0359, 'Toyota Sienna'],
       [9, 30415.85, 90.985, 541.48, 29874.37, 0.0359, 'Toyota Sienna'],
       [10, 29874.37, 89.37, 543.1, 29331.27, 0.0359, 'Toyota Sienna'],
       [11, 29331.27, 87.74, 544.73, 28786.54, 0.0359, 'Toyota Sienna'],
       [12, 28786.54, 86.11, 546.36, 28240.18, 0.0359, 'Toyota Sienna'],
       [13, 28240.18, 84.48, 547.99, 27692.19, 0.0359, 'Toyota Sienna'],
       [14, 27692.19, 82.84, 549.63, 27142.56, 0.0359, 'Toyota Sienna'],
       [15, 27142.56, 81.2, 551.27, 26591.29, 0.0359, 'Toyota Sienna'],
       [16, 26591.29, 79.55, 552.92, 26038.37, 0.0359, 'Toyota Sienna'],
       [17, 26038.37, 77.89, 554.58, 25483.79, 0.0359, 'Toyota Sienna'],
       [18, 25483.79, 76.23, 556.24, 24927.55, 0.0359, 'Toyota Sienna'],
       [19, 24927.55, 74.57, 557.9, 24369.65, 0.0359, 'Toyota Sienna'],
       [20, 24369.65, 72.9, 559.57, 23810.08, 0.0359, 'Toyota Sienna'],
       [21, 23810.08, 71.23, 561.24, 23248.84, 0.0359, 'Toyota Sienna'],
       [22, 23248.84, 69.55, 562.92, 22685.92, 0.0359, 'Toyota Sienna'],
       [23, 22685.92, 67.86, 564.61, 22121.31, 0.0359, 'Toyota Sienna'],
       [24, 22121.31, 66.17, 566.3, 21555.01, 0.0359, 'Toyota Sienna'],
       [25, 21555.01, 64.48, 567.99, 20987.02, 0.0359, 'Toyota Sienna'],
       [26, 20987.02, 62.78, 569.69, 20417.33, 0.0359, 'Toyota Sienna'],
       [27, 20417.33, 61.08, 571.39, 19845.94, 0.0359, 'Toyota Sienna'],
       [28, 19845.94, 59.37, 573.1, 19272.84, 0.0359, 'Toyota Sienna'],
       [29, 19272.84, 57.65, 574.82, 18698.02, 0.0359, 'Toyota Sienna'],
       [30, 18698.02, 55.93, 576.54, 18121.48, 0.0359, 'Toyota Sienna'],
       [31, 18121.48, 54.21, 578.26, 17543.22, 0.0359, 'Toyota Sienna'],
       [32, 17543.22, 52.48, 579.99, 16963.23, 0.0359, 'Toyota Sienna'],
       [33, 16963.23, 50.74, 581.73, 16381.5, 0.0359, 'Toyota Sienna'],
       [34, 16381.5, 49.0, 583.47, 15798.03, 0.0359, 'Toyota Sienna'],
       [35, 15798.03, 47.26, 585.21, 15212.82, 0.0359, 'Toyota Sienna'],
       [36, 15212.82, 45.51, 586.96, 14625.86, 0.0359, 'Toyota Sienna'],
       [37, 14625.86, 43.75, 588.72, 14037.14, 0.0359, 'Toyota Sienna'],
       [38, 14037.14, 41.99, 590.48, 13446.66, 0.0359, 'Toyota Sienna'],
       [39, 13446.66, 40.22, 592.25, 12854.41, 0.0359, 'Toyota Sienna'],
       [40, 12854.41, 38.45, 594.02, 12260.39, 0.0359, 'Toyota Sienna'],
       [41, 12260.39, 36.67, 595.8, 11664.59, 0.0359, 'Toyota Sienna'],
       [42, 11664.59, 34.89, 597.58, 11067.01, 0.0359, 'Toyota Sienna'],
       [43, 11067.01, 33.1, 599.37, 10467.64, 0.0359, 'Toyota Sienna'],
       [44, 10467.64, 31.31, 601.16, 9866.48, 0.0359, 'Toyota Sienna'],
       [45, 9866.48, 29.51, 602.96, 9263.52, 0.0359, 'Toyota Sienna'],
       [46, 9263.52, 27.71, 604.76, 8658.76, 0.0359, 'Toyota Sienna'],
       [47, 8658.76, 25.9, 606.57, 8052.19, 0.0359, 'Toyota Sienna'],
       [48, 8052.19, 24.08, 608.39, 7443.8, 0.0359, 'Toyota Sienna'],
       [49, 7443.8, 22.26, 610.21, 6833.59, 0.0359, 'Toyota Sienna'],
       [50, 6833.59, 20.44, 612.03, 6221.56, 0.0359, 'Toyota Sienna'],
       [51, 6221.56, 18.61, 613.86, 5607.7, 0.0359, 'Toyota Sienna'],
       [52, 5607.7, 16.77, 615.7, 4992.0, 0.0359, 'Toyota Sienna'],
       [53, 4992.0, 14.93, 617.54, 4374.46, 0.0359, 'Toyota Sienna'],
       [54, 4374.46, 13.08, 619.39, 3755.07, 0.0359, 'Toyota Sienna'],
       [55, 3755.07, 11.23, 621.24, 3133.83, 0.0359, 'Toyota Sienna'],
       [56, 3133.83, 9.37, 623.1, 2510.73, 0.0359, 'Toyota Sienna'],
       [57, 2510.73, 7.51, 624.96, 1885.77, 0.0359, 'Toyota Sienna'],
       [58, 1885.77, 5.64, 626.83, 1258.94, 0.0359, 'Toyota Sienna'],
       [59, 1258.94, 3.76, 628.71, 630.23, 0.0359, 'Toyota Sienna'],
       [60, 630.23, 1.88, 630.59, -0.36, 0.0359, 'Toyota Sienna']],
      dtype=object)

In [115]:
df.to_csv('car_int.csv',index=False)